openFoam/preProc/headCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    "(outlet|outlet_2)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    oversetPatch
    {
        type            overset;
        value           $internalField;
    }
    "(canal|canal_2|prop_hub|rect_hub|rect_blades|shaft|prop_blades)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(prop_blades|prop_hub|shaft)"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
