openFoam/preProc/headCase/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (U* 0 0);
turbulentKE          k*;
turbulentOmega       omega*;

// ************************************************************************* //
