openFoam/preProc/headCase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    oversetPatch
    {
        type            overset;
        value           uniform 0;
    }

    "(outlet)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(outlet_2)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(canal|canal_2|rect_hub|rect_blades|prop_hub|prop_blades|shaft)"
    {
        type            zeroGradient;
    }

  }

// ************************************************************************* //
