openFoam/preProc/headCase/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
	gradient	$internalField;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            totalPressure;
        rho		rho;
	psi		none;
	gamma		1;
	p0              $internalField;
        value           $internalField;
    }

    hull
    {
        type            fixedFluxPressure;
        value           $internalField;
	gradient	$internalField;
    }

    bottom 
    { type symmetry; }
    side
    { type symmetry; }
    symmetry
    { type symmetry; }

}

// ************************************************************************* //
